## Array

In [ ]:
#Q1. There are two lists:
l1 = [1,2,3,5,7,8,9,2]
l2 = [2,4,6,7,8,0,2]

# Write a Python program to find the unique common elements between two lists.

Return the most frequent letter(s) in text and how many times it is repeated.

def most_frequent_letters(input_string):
  <!-- Return the most frequent letter in text.
  >>> find_most_frequent_letter("This is a super long long long string. Please help count me") -->
  


most_frequent_letters("This is a super long long long string. Please help count me") -> (['s', 'e', 'l', 'n'], 5)

## String Manipulation

How would you extract the domain (e.g., "example.com") from an email address string?

Ex. Input : "user@example.com", Output: "example.com"

# Python Functions

Write a recursive function to compute the factorial of a given number x.

## Data Analysis

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head(10)

Calculate the average age for each sex by -

a) Group by

b) Slicing

 Suggest how will you handle null values in column

a) Embarked

b) Age

You are given a DataFrame df that contains data on multiple trades for various leads and their performance. The DataFrame includes the following columns:

lead_id: The identifier for the lead.

trade: The trade identifier.

delinquent: An indicator of the trade's performance (1 indicates poor performance, 0 indicates good performance).

Q) Catogerize each loan as secured loan or unsecured loan:

secured loan:['Two-Wheeler', 'Housing Loan']

unsecured loan: ['Personal Loan']

In [ ]:
import pandas as pd

data = {
    'lead_id': [123, 123, 123, 234, 234, 234, 345, 345, 345],
    'loan_type': ['Personal Loan', 'Two-Wheeler', 'Housing Loan', 'Personal Loan', 'Two-Wheeler', 'Housing Loan', 'Personal Loan', 'Two-Wheeler', 'Housing Loan'],
    'delinquent': [0, 0, 0, 1, 0, 0, 0, 1, 0]
}
df1 = pd.DataFrame(data)
df1.head()

A lead is considered "good" if all its trades have a delinquency value of 0. If any trade for a lead has a delinquency value of 1, the lead is considered "bad".

Write a function that prints all unique leads along with their overall profile ("good" or "bad").

In [ ]:
destination = 'Data/Retail_Transactions_Dataset.csv'

import gdown

file_id = '1IJ44ERujPp67Vw3wr6BsxUNet3yqI061'

# Construct the download URL
download_url = f'https://drive.google.com/uc?id={file_id}'

# Download the file
gdown.download(download_url, destination, quiet=False)

# Load into a DataFrame
df = pd.read_csv(destination)
df.drop(columns='Total_Items', inplace=True)
# Display the first few rows
df.head()

i) Identify the customer with most purchases.


ii) Add a new column that calculates the average product price for each "Transaction_ID", defined as the total cost divided by the number of items purchased.

iii) Display the distribution of different "Payment_Method"

# SQL

In [27]:
# Importing necessary libraries
import sqlite3
import pandas as pd

# Create a connection to an SQLite database in memory
conn = sqlite3.connect(':memory:')

# Creating a cursor object to execute SQLite commands
cursor = conn.cursor()

In [28]:
# SQL command to create the Departments table
cursor.execute('''
CREATE TABLE Departments (
    DepartmentID INTEGER PRIMARY KEY,
    DepartmentName TEXT NOT NULL
);
''')

# SQL command to create the Employees table
cursor.execute('''
CREATE TABLE Employees (
    EmployeeID INTEGER PRIMARY KEY,
    Name TEXT NOT NULL,
    DepartmentID INTEGER,
    Salary INTEGER,
    ManagerID INTEGER,  -- Reference to EmployeeID of the manager
    FOREIGN KEY (DepartmentID) REFERENCES Departments(DepartmentID),
    FOREIGN KEY (ManagerID) REFERENCES Employees(EmployeeID)
);
''')

# SQL command to create the Projects table
cursor.execute('''
CREATE TABLE Projects (
    ProjectID INTEGER PRIMARY KEY,
    ProjectName TEXT NOT NULL,
    DepartmentID INTEGER,
    Budget INTEGER,
    FOREIGN KEY (DepartmentID) REFERENCES Departments(DepartmentID)
);
''')

print("Tables created successfully!")

# Inserting data into Departments
departments_data = [
    (1, 'IT'),
    (2, 'HR'),
    (3, 'Marketing'),
    (4, 'Sales'),
    (5, 'Finance'),
    (6, 'Research and Development'),
    (7, 'Customer Support'),
    (8, 'Legal'),
    (9, 'Product Development')
]

# Inserting data into Employees
employees_data = [
    (1, 'Alice', 1, 90000, None),   # CEO, no manager
    (2, 'Bob', 1, 75000, 1),        # Reports to Alice
    (3, 'Charlie', 2, 50000, 2),    # Reports to Bob
    (4, 'David', 3, 60000, 2),      # Reports to Bob
    (5, 'Eve', 4, 70000, 3),        # Reports to Charlie
    (6, 'Frank', 5, 85000, 1),      # Reports to Alice
    (7, 'Grace', 1, 65000, 2),      # Reports to Bob
    (8, 'Heidi', 2, 45000, 3),      # Reports to Charlie
    (9, 'Ivan', 3, 67000, 4),       # Reports to David
    (10, 'Judy', 4, 73000, 5),      # Reports to Eve
    (11, 'Karl', 5, 48000, 6),      # Reports to Frank
    (12, 'Lara', 1, 50000, 7),      # Reports to Grace
    (13, 'Morgan', 2, 51000, 8),    # Reports to Heidi
    (14, 'Nina', 3, 93000, 9),      # Reports to Ivan
    (15, 'Oscar', 4, 55000, 10),    # Reports to Judy
    (16, 'Paula', 5, 87000, 11),    # Reports to Karl
    (17, 'Quinn', 1, 49000, 12),    # Reports to Lara
    (18, 'Rachel', 2, 85000, 13),   # Reports to Morgan
    (19, 'Steve', 3, 64000, 14),    # Reports to Nina
    (20, 'Tina', 4, 46000, 15)      # Reports to Oscar
]

# Inserting data into Projects
projects_data = [
    (1, 'Project Alpha', 1, 20000),
    (2, 'Project Beta', 2, 15000),
    (3, 'Project Gamma', 3, 25000),
    (4, 'Project Delta', 4, 30000),
    (5, 'Project Epsilon', 5, 45000),
    (6, 'Project Zeta', 3, 5000),
    (7, 'Project Eta', 6, 40000),
    (8, 'Project Theta', 1, 25000),
    (9, 'Project Iota', 2, 10000),
    (10, 'Project Kappa', 1, 15000),
    (11, 'Project Lambda', 7, 22000),
    (12, 'Project Mu', 8, 18000),
    (13, 'Project Nu', 9, 30000),
    (14, 'Project Xi', 6, 33000),
    (15, 'Project Omicron', 4, 40000)
]

# Execute insertion for Departments
cursor.executemany('INSERT INTO Departments VALUES (?, ?);', departments_data)

# Execute insertion for Employees
cursor.executemany('INSERT INTO Employees VALUES (?, ?, ?, ?, ?);', employees_data)

# Execute insertion for Projects
cursor.executemany('INSERT INTO Projects VALUES (?, ?, ?, ?);', projects_data)

conn.commit()  # Committing changes to the database
print("All dummy data inserted successfully!")

Tables created successfully!
All dummy data inserted successfully!

In [29]:
# SQL command to create the Departments table
df = pd.read_sql_query('''
SELECT * FROM Departments
;
''', conn)
df.head(3)

   DepartmentID DepartmentName
0             1             IT
1             2             HR
2             3      Marketing

In [30]:
df = pd.read_sql_query('''
SELECT * FROM Employees
;
''', conn)
df.head(3)

   EmployeeID     Name  DepartmentID  Salary  ManagerID
0           1    Alice             1   90000        NaN
1           2      Bob             1   75000        1.0
2           3  Charlie             2   50000        2.0

In [31]:
df = pd.read_sql_query('''
SELECT * FROM Projects
;
''', conn)
df.head(3)

   ProjectID    ProjectName  DepartmentID  Budget
0          1  Project Alpha             1   20000
1          2   Project Beta             2   15000
2          3  Project Gamma             3   25000

| Table        | Key               | Foreign Key in Table | Relationship                        | Example Data               |
|--------------|-------------------|----------------------|-------------------------------------|----------------------------|
| Departments  | DepartmentID      | Employees            | One Department has many Employees   | ID: 1, Name: IT            |
|              |                   | Projects             | One Department has many Projects    | ID: 2, Name: HR            |
| Employees    | EmployeeID        | -                    | -                                   | ID: 1, Name: Alice, DepartmentID: 1, Salary: 70000 |
|              | DepartmentID      | Departments          | Many Employees belong to one Department | -                          |
| Projects     | ProjectID         | -                    | -                                   | ID: 1, Name: Project Alpha, DepartmentID: 1, Budget: 20000 |
|              | DepartmentID      | Departments          | Many Projects are handled by one Department | -                          |

Find the total salary expenditure for each department.

List all departments along with the count of employees and the total budget of projects they are handling, ordered by the total budget in descending order.

Retrieve the highest salary from the employees who are working on only one project.

List all projects with their respective department names, where the project budget is more than the median budget of all projects.

Given the employee table where each employee can have a manager (who is also an employee), write a query to display the hierarchy of employees. Specifically, for a given employee, list the employee's name, their manager's name, and all higher-level managers up to the CEO (an employee with no manager).

Input: Judy

Output

**Employee**

Alice

Bob

Charlie

Eve

Judy